urbanFlow/sRiver/urans/winter/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application foamRun;
solver incompressibleFluid;
stopAt endTime;
endTime 200;
deltaT 0.05;
writeControl adjustableRunTime;
writeInterval 5;
purgeWrite 3;
adjustTimeStep yes;
maxCo 5.0;

startTime       0;
writeFormat     ascii;
writePrecision  6;
runTimeModifiable true;
libs ("libatmosphericModels.so");